
'''
FOR LOOP

วิธีใช้
for ตัวแปร in range (ค่าที่ต้องการให้เป็นตัวเริ่ม, จำนวนตัว):

คำสั่ง
if ตัวแปร กำหนดคำสั่งหรือฟังก์ชั่น:
    continue ดำเนินการคำสั่งหรือฟังก์ชั่นนั้นๆ

    **เพิ่มเติม คำสั่ง continue
    เป็นคำสั่งที่สั่งให้โปรแกรมกลับไปเริ่มต้นใหม่ที่ต้น loop
    ซึ่งผลให้คำสั่ง ที่ เหลือทั้งหมดหลังคำสั่ง continue
    และอยู่ภายในขอบเขตของคำสั่งทำซ้ำจะไม่ถูกประมวลผลในรอบ นั้นๆ
    ไปด้วย (แต่ไม่ได้ออกจากคำสั่งการทำซ้ำ) คำสั่ง continue จะใช้ได้ทั้ง while และ for loop.

if ตัวแปร กำหนดคำสั่งหรือฟังก์ชั่น:
    break เมื่อถึงเงื่อนไขเป็นไปตามคำสั่งหรือฟังก์ชั่น จะหยุดดำเนินการคำสั่งหรือฟังก์ชั่นนั้นๆ
'''


for i in range(3):          #กำหนด i = ตัวเลขใน3จำนวน เริ่มจาก0
    print(i)                #run i แล้วจะได้ 0 1 2 (3จำนวน เริ่มจาก0)


for n in range(1, 3):       #กำหนด n = ตัวเลขใน2จำนวน เริ่มจาก1(เขียนเป็น3เพราะจริงๆต้องเริ่มจาก0)
    print(n)                #run n แล้วจะได้ 1 2 (2จำนวน เริ่มจาก 1)


for x in range(1, 3):       #กำหนด x = ตัวเลขใน2จำนวน เริ่มจาก1(เขียนเป็น3เพราะจริงๆต้องเริ่มจาก0) x = 1 กับ 2
    double = x * 2          #กำหนด double = x คูณ 2
    print(double)           #run double จะได้ 1*2 กับ 2*2 = 2 กับ 4


for y in range(1, 11):      #กำหนด y = ตัวเลขใน10จำนวน เริ่มจาก1(เขียนเป็น11เพราะจริงๆต้องเริ่มจาก0) y = 1,2,3,4,5,6,7,8,9,10
    if y % 3 == 0:          #กำหนดเงื่อไข ถ้าตัวเลขใน y หารด้วย3 ลงตัว จะไม่แสดงผล(จะข้ามการแสดงผลนั้น) (ใน y มี 3,6,9 ที่3หารลงตัว ตรงตามเงื่อนไข จึงไม่แสดงผล)
        continue            #continue (จะข้ามการแสดงผลนั้นใน y คือ 3,6,9)
    print(y)                #run y จะได้ 1 2 4 5 7 8 10


for z in range(1, 6):       #กำหนด z = ตัวเลขใน5จำนวน เริ่มจาก1(เขียนเป็น6เพราะจริงๆต้องเริ่มจาก0) z = 1,2,3,4,5
    if z % 3 == 0:          #กำหนดเงื่อนไข ถ้าตัวเลขใน z หารด้วย3 ลงตัว จะไม่แสดงผล(จะข้ามการแสดงผลนั้น) (ใน z มี 3 ที่3หารลงตัว ตรงตามเงื่อนไข)
        break               #break (จะทำการหยุดเมื่อดำเนินการถึงตัวที่ตรงเงื่อนไข คือ เมื่อถึงเลข 3 จะหยุดrunทันที)
    print(z)                #run z จะได้ 1 2 (หยุดที่ 3 )