''' ISBN '''
def isbn():
    ''' เลขมาตรฐานสากลประจำหนังสือ (International Standard Book Number) '''

    # มีเลข 10, 13หลัก แบ่งด้วย (-)
    # ส่วนที่ 1 ถ้าเป็นรหัส 13 ตัว จะขึ้นต้นด้วยรหัสของ
    # European Article Numbering-Uniform Code Council คือ 978 หรือ 979 (รหัส 10 ตัว จะไม่มีส่วนนี้)
    # ส่วนที่ 2 รหัสประเทศ เช่น สำหรับประเทศไทย ใช้ 974
    # ส่วนที่ 3 รหัสสำนักพิมพ์ เช่นสำนักพิมพ์นานมีบุคส์ ใช้ 472
    # ส่วนที่ 4 รหัสชื่อเรื่อง เป็นลำดับของสิ่งพิมพ์ที่ผลิตจากสำนักพิมพ์นั้น ๆ
    # ส่วนที่ 5 เลขตรวจสอบ ใช้ตรวจในระบบคอมพิวเตอร์จากการคำนวณเลข 9 ตำแหน่ง ของส่วนที่ 2-4

    # ที่นี้ใช้ 10 หลัก คำนวณ 9หลักแรก
    # * หลักแรกด้วย 10 หลักสองด้วย 9 สาม 8 จนถึงหลักเก้าด้วย 2
    # แล้วนำทั้งหมดมาบวกกัน แล้ว mod(%) ด้วย 11

    num = input().replace('-', '')
    mul = 10
    total = 0
    for i in range(len(num)-1):
        total += (mul * int(num[i]))
        #print(mul, int(num[i]))
        mul -= 1

    # num_x คือ ค่าที่ได้จากการคำนวณหลักแรกถึงหลักที่ 9
    num_x = (-1 * total) % 11

    #สำหรับกรณีที่หาค่ามอดุลาร์ได้ 10 จะใช้ตัวอักษร X พิมพ์ใหญ่ในภาษาอังกฤษแทน
    if num_x == 10:
        num_x = 'X'

    # check num_x = หลักที่ 10 ของ isbn
    if str(num_x) == num[9]:
        print('Yes')
    else:
        print('No %s' %num_x)
isbn()
